final List<Map<String, dynamic>> mockPlaceCategories = [
  {"id": 1, "name": "Экотуризм", "description": "Путешествия с акцентом на природу и устойчивость, минимальный экологический след."},
  {"id": 2, "name": "Гастротуризм", "description": "Знакомство с местной кухней, дегустации и кулинарные маршруты."},
  {"id": 3, "name": "Агротуризм", "description": "Проживание на фермах, участие в сельскохозяйственных активностях."},
  {"id": 4, "name": "Историко-культурный туризм", "description": "Посещение музеев, памятников и культурных событий."},
  {"id": 5, "name": "Экстремальный туризм", "description": "Адреналиновые активности: рафтинг, альпинизм, скалолазание."},
  {"id": 6, "name": "Активный туризм", "description": "Походы, веломаршруты, треккинг и спортивные активности."},
  {"id": 7, "name": "Горнолыжный туризм", "description": "Катание на лыжах и сноуборде, зимние горные курорты."},
  {"id": 8, "name": "Курортно-оздоровительный туризм", "description": "Санатории, термальные источники, программы восстановления."},
  {"id": 9, "name": "Урбан-туризм", "description": "Исследование городов, архитектуры, ночной жизни и арт-пространств."},
  {"id": 10, "name": "Сельский туризм", "description": "Размеренный отдых в деревнях, знакомство с бытом и традициями."},
  {"id": 11, "name": "Арт-туризм", "description": "Галереи, фестивали, резиденции и маршруты современного искусства."},
];
